netify-soap/src/test/resources/soap/requests/movie/GetMovieByIdForUpdatesRequestTest.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:gen="http://duo.nl/namespace/netify/general">
    <soapenv:Header/>
    <soapenv:Body>
        <gen:GetMovieByIdRequest>
            <gen:id>11</gen:id>
        </gen:GetMovieByIdRequest>
    </soapenv:Body>
</soapenv:Envelope>